#ifndef ARGUMENTS_H
#define ARGUMENTS_H

#include <QString>
//-----------------------------------------------------------------------------------------------------------------------------------

struct Arguments
{
public:
    Arguments();
    Arguments(int argc, char* argv[]);

    QString pathIn;   ///< Путь входного файла
    QString pathOut;  ///< Путь выходного файла
    bool    isHelp;   ///< Признак, продолжает программа работать или нет
};
//-----------------------------------------------------------------------------------------------------------------------------------

#endif // ARGUMENTS_H

